meihao1203/amforth-6.5/amforth-6.5/msp430/devices/msp430f5529/msp430f5529.inc
/* ============================================================================ */
/* Copyright (c) 2015, Texas Instruments Incorporated                           */
/*  All rights reserved.                                                        */
/*                                                                              */
/*  Redistribution and use in source and binary forms, with or without          */
/*  modification, are permitted provided that the following conditions          */
/*  are met:                                                                    */
/*                                                                              */
/*  *  Redistributions of source code must retain the above copyright           */
/*     notice, this list of conditions and the following disclaimer.            */
/*                                                                              */
/*  *  Redistributions in binary form must reproduce the above copyright        */
/*     notice, this list of conditions and the following disclaimer in the      */
/*     documentation and/or other materials provided with the distribution.     */
/*                                                                              */
/*  *  Neither the name of Texas Instruments Incorporated nor the names of      */
/*     its contributors may be used to endorse or promote products derived      */
/*     from this software without specific prior written permission.            */
/*                                                                              */
/*  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" */
/*  AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,       */
/*  THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR      */
/*  PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR            */
/*  CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,       */
/*  EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,         */
/*  PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; */
/*  OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,    */
/*  WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR     */
/*  OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,              */
/*  EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.                          */
/* ============================================================================ */

/********************************************************************
*
* Standard register and bit definitions for the Texas Instruments
* MSP430 microcontroller.
*
* This file supports assembler and C development for
* MSP430F5529 devices.
*
* Texas Instruments, Version 1.4
*
* Rev. 1.0, Setup
* Rev. 1.1, Fixed Error in DMA Trigger Definitons
* Rev. 1.2, fixed SYSUNIV_BUSIFG definition
*           fixed wrong bit definition in PM5CTL0 (LOCKLPM5)
* Rev. 1.3, Changed access type of DMAxSZ registers to word only
* Rev. 1.4  Changed access type of TimerA/B registers to word only
*
********************************************************************/

/************************************************************
* STANDARD BITS
************************************************************/

#define BIT0                (0x0001)
#define BIT1                (0x0002)
#define BIT2                (0x0004)
#define BIT3                (0x0008)
#define BIT4                (0x0010)
#define BIT5                (0x0020)
#define BIT6                (0x0040)
#define BIT7                (0x0080)
#define BIT8                (0x0100)
#define BIT9                (0x0200)
#define BITA                (0x0400)
#define BITB                (0x0800)
#define BITC                (0x1000)
#define BITD                (0x2000)
#define BITE                (0x4000)
#define BITF                (0x8000)

/************************************************************
* STATUS REGISTER BITS
************************************************************/

#define C                   (0x0001)
#define Z                   (0x0002)
#define N                   (0x0004)
#define V                   (0x0100)
#define GIE                 (0x0008)
#define CPUOFF              (0x0010)
#define OSCOFF              (0x0020)
#define SCG0                (0x0040)
#define SCG1                (0x0080)

/* Low Power Modes coded with Bits 4-7 in SR */

#define LPM0                (CPUOFF)
#define LPM1                (SCG0+CPUOFF)
#define LPM2                (SCG1+CPUOFF)
#define LPM3                (SCG1+SCG0+CPUOFF)
#define LPM4                (SCG1+SCG0+OSCOFF+CPUOFF)
/* End #defines for assembler */

/************************************************************
* CPU
************************************************************/

/************************************************************
* PERIPHERAL FILE MAP
************************************************************/


/************************************************************
* ADC12 PLUS
************************************************************/

#define ADC12CTL0            0x0700    /* ADC12+ Control 0 */
#define ADC12CTL1            0x0702    /* ADC12+ Control 1 */
#define ADC12CTL2            0x0704    /* ADC12+ Control 2 */
#define ADC12IFG             0x070A    /* ADC12+ Interrupt Flag */
#define ADC12IE              0x070C    /* ADC12+ Interrupt Enable */
#define ADC12IV              0x070E    /* ADC12+ Interrupt Vector Word */
#define ADC12MEM0            0x0720    /* ADC12 Conversion Memory 0 */
#define ADC12MEM1            0x0722    /* ADC12 Conversion Memory 1 */
#define ADC12MEM2            0x0724    /* ADC12 Conversion Memory 2 */
#define ADC12MEM3            0x0726    /* ADC12 Conversion Memory 3 */
#define ADC12MEM4            0x0728    /* ADC12 Conversion Memory 4 */
#define ADC12MEM5            0x072A    /* ADC12 Conversion Memory 5 */
#define ADC12MEM6            0x072C    /* ADC12 Conversion Memory 6 */
#define ADC12MEM7            0x072E    /* ADC12 Conversion Memory 7 */
#define ADC12MEM8            0x0730    /* ADC12 Conversion Memory 8 */
#define ADC12MEM9            0x0732    /* ADC12 Conversion Memory 9 */
#define ADC12MEM10           0x0734    /* ADC12 Conversion Memory 10 */
#define ADC12MEM11           0x0736    /* ADC12 Conversion Memory 11 */
#define ADC12MEM12           0x0738    /* ADC12 Conversion Memory 12 */
#define ADC12MEM13           0x073A    /* ADC12 Conversion Memory 13 */
#define ADC12MEM14           0x073C    /* ADC12 Conversion Memory 14 */
#define ADC12MEM15           0x073E    /* ADC12 Conversion Memory 15 */
#define ADC12MEM            ADC12MEM0 /* ADC12 Conversion Memory (for assembler) */

#define ADC12MCTL0           0x0710    /* ADC12 Memory Control 0 */
#define ADC12MCTL1           0x0711    /* ADC12 Memory Control 1 */
#define ADC12MCTL2           0x0712    /* ADC12 Memory Control 2 */
#define ADC12MCTL3           0x0713    /* ADC12 Memory Control 3 */
#define ADC12MCTL4           0x0714    /* ADC12 Memory Control 4 */
#define ADC12MCTL5           0x0715    /* ADC12 Memory Control 5 */
#define ADC12MCTL6           0x0716    /* ADC12 Memory Control 6 */
#define ADC12MCTL7           0x0717    /* ADC12 Memory Control 7 */
#define ADC12MCTL8           0x0718    /* ADC12 Memory Control 8 */
#define ADC12MCTL9           0x0719    /* ADC12 Memory Control 9 */
#define ADC12MCTL10          0x071A    /* ADC12 Memory Control 10 */
#define ADC12MCTL11          0x071B    /* ADC12 Memory Control 11 */
#define ADC12MCTL12          0x071C    /* ADC12 Memory Control 12 */
#define ADC12MCTL13          0x071D    /* ADC12 Memory Control 13 */
#define ADC12MCTL14          0x071E    /* ADC12 Memory Control 14 */
#define ADC12MCTL15          0x071F    /* ADC12 Memory Control 15 */
#define ADC12MCTL           ADC12MCTL0 /* ADC12 Memory Control (for assembler) */

/* ADC12CTL0 Control Bits */
#define ADC12SC             (0x0001)  /* ADC12 Start Conversion */
#define ADC12ENC            (0x0002)  /* ADC12 Enable Conversion */
#define ADC12TOVIE          (0x0004)  /* ADC12 Timer Overflow interrupt enable */
#define ADC12OVIE           (0x0008)  /* ADC12 Overflow interrupt enable */
#define ADC12ON             (0x0010)  /* ADC12 On/enable */
#define ADC12REFON          (0x0020)  /* ADC12 Reference on */
#define ADC12REF2_5V        (0x0040)  /* ADC12 Ref 0:1.5V / 1:2.5V */
#define ADC12MSC            (0x0080)  /* ADC12 Multiple SampleConversion */
#define ADC12SHT00          (0x0100)  /* ADC12 Sample Hold 0 Select Bit: 0 */
#define ADC12SHT01          (0x0200)  /* ADC12 Sample Hold 0 Select Bit: 1 */
#define ADC12SHT02          (0x0400)  /* ADC12 Sample Hold 0 Select Bit: 2 */
#define ADC12SHT03          (0x0800)  /* ADC12 Sample Hold 0 Select Bit: 3 */
#define ADC12SHT10          (0x1000)  /* ADC12 Sample Hold 1 Select Bit: 0 */
#define ADC12SHT11          (0x2000)  /* ADC12 Sample Hold 1 Select Bit: 1 */
#define ADC12SHT12          (0x4000)  /* ADC12 Sample Hold 1 Select Bit: 2 */
#define ADC12SHT13          (0x8000)  /* ADC12 Sample Hold 1 Select Bit: 3 */

/* ADC12CTL0 Control Bits */
#define ADC12SC_L           (0x0001)  /* ADC12 Start Conversion */
#define ADC12ENC_L          (0x0002)  /* ADC12 Enable Conversion */
#define ADC12TOVIE_L        (0x0004)  /* ADC12 Timer Overflow interrupt enable */
#define ADC12OVIE_L         (0x0008)  /* ADC12 Overflow interrupt enable */
#define ADC12ON_L           (0x0010)  /* ADC12 On/enable */
#define ADC12REFON_L        (0x0020)  /* ADC12 Reference on */
#define ADC12REF2_5V_L      (0x0040)  /* ADC12 Ref 0:1.5V / 1:2.5V */
#define ADC12MSC_L          (0x0080)  /* ADC12 Multiple SampleConversion */

/* ADC12CTL0 Control Bits */
#define ADC12SHT00_H        (0x0001)  /* ADC12 Sample Hold 0 Select Bit: 0 */
#define ADC12SHT01_H        (0x0002)  /* ADC12 Sample Hold 0 Select Bit: 1 */
#define ADC12SHT02_H        (0x0004)  /* ADC12 Sample Hold 0 Select Bit: 2 */
#define ADC12SHT03_H        (0x0008)  /* ADC12 Sample Hold 0 Select Bit: 3 */
#define ADC12SHT10_H        (0x0010)  /* ADC12 Sample Hold 1 Select Bit: 0 */
#define ADC12SHT11_H        (0x0020)  /* ADC12 Sample Hold 1 Select Bit: 1 */
#define ADC12SHT12_H        (0x0040)  /* ADC12 Sample Hold 1 Select Bit: 2 */
#define ADC12SHT13_H        (0x0080)  /* ADC12 Sample Hold 1 Select Bit: 3 */

