meihao1203/amforth-6.5/amforth-6.5/msp430/devices/msp430f5529/msp430f5529.inc
//values of USBVECINT when USB-interrupt occured
#define     USBVECINT_NONE                     0x00
#define     USBVECINT_PWR_DROP                 0x02
#define     USBVECINT_PLL_LOCK                 0x04
#define     USBVECINT_PLL_SIGNAL               0x06
#define     USBVECINT_PLL_RANGE                0x08
#define     USBVECINT_PWR_VBUSOn               0x0A
#define     USBVECINT_PWR_VBUSOff              0x0C
#define     USBVECINT_USB_TIMESTAMP            0x10
#define     USBVECINT_INPUT_ENDPOINT0          0x12
#define     USBVECINT_OUTPUT_ENDPOINT0         0x14
#define     USBVECINT_RSTR                     0x16
#define     USBVECINT_SUSR                     0x18
#define     USBVECINT_RESR                     0x1A
#define     USBVECINT_SETUP_PACKET_RECEIVED    0x20
#define     USBVECINT_STPOW_PACKET_RECEIVED    0x22
#define     USBVECINT_INPUT_ENDPOINT1          0x24
#define     USBVECINT_INPUT_ENDPOINT2          0x26
#define     USBVECINT_INPUT_ENDPOINT3          0x28
#define     USBVECINT_INPUT_ENDPOINT4          0x2A
#define     USBVECINT_INPUT_ENDPOINT5          0x2C
#define     USBVECINT_INPUT_ENDPOINT6          0x2E
#define     USBVECINT_INPUT_ENDPOINT7          0x30
#define     USBVECINT_OUTPUT_ENDPOINT1         0x32
#define     USBVECINT_OUTPUT_ENDPOINT2         0x34
#define     USBVECINT_OUTPUT_ENDPOINT3         0x36
#define     USBVECINT_OUTPUT_ENDPOINT4         0x38
#define     USBVECINT_OUTPUT_ENDPOINT5         0x3A
#define     USBVECINT_OUTPUT_ENDPOINT6         0x3C
#define     USBVECINT_OUTPUT_ENDPOINT7         0x3E


/* ========================================================================= */
/* USB Operation Registers */
/* ========================================================================= */

#define USBIEPSIZXY_7        0x23FF    /* Input Endpoint_7: X/Y-buffer size  */
#define USBIEPBCTY_7         0x23FE    /* Input Endpoint_7: Y-byte count  */
#define USBIEPBBAY_7         0x23FD    /* Input Endpoint_7: Y-buffer base addr.  */
//sfrb    Spare       (0x23FC)   /* Not used  */
//sfrb    Spare       (0x23FB)   /* Not used  */
#define USBIEPBCTX_7         0x23FA    /* Input Endpoint_7: X-byte count  */
#define USBIEPBBAX_7         0x23F9    /* Input Endpoint_7: X-buffer base addr. */
#define USBIEPCNF_7          0x23F8    /* Input Endpoint_7: Configuration  */
#define USBIEPSIZXY_6        0x23F7    /* Input Endpoint_6: X/Y-buffer size  */
#define USBIEPBCTY_6         0x23F6    /* Input Endpoint_6: Y-byte count */
#define USBIEPBBAY_6         0x23F5    /* Input Endpoint_6: Y-buffer base addr. */
//sfrb    Spare       (0x23F4)   /* Not used  */
//sfrb    Spare       (0x23F3)   /* Not used  */
#define USBIEPBCTX_6         0x23F2    /* Input Endpoint_6: X-byte count */
#define USBIEPBBAX_6         0x23F1    /* Input Endpoint_6: X-buffer base addr. */
#define USBIEPCNF_6          0x23F0    /* Input Endpoint_6: Configuration */
#define USBIEPSIZXY_5        0x23EF    /* Input Endpoint_5: X/Y-buffer size */
#define USBIEPBCTY_5         0x23EE    /* Input Endpoint_5: Y-byte count */
#define USBIEPBBAY_5         0x23ED    /* Input Endpoint_5: Y-buffer base addr. */
//sfrb    Spare       (0x23EC)   /* Not used */
//sfrb    Spare       (0x23EB)   /* Not used */
#define USBIEPBCTX_5         0x23EA    /* Input Endpoint_5: X-byte count */
#define USBIEPBBAX_5         0x23E9    /* Input Endpoint_5: X-buffer base addr. */
#define USBIEPCNF_5          0x23E8    /* Input Endpoint_5: Configuration */
#define USBIEPSIZXY_4        0x23E7    /* Input Endpoint_4: X/Y-buffer size */
#define USBIEPBCTY_4         0x23E6    /* Input Endpoint_4: Y-byte count */
#define USBIEPBBAY_4         0x23E5    /* Input Endpoint_4: Y-buffer base addr. */
//sfrb    Spare       (0x23E4)   /* Not used */
//sfrb    Spare       (0x23E3)   /* Not used */
#define USBIEPBCTX_4         0x23E2    /* Input Endpoint_4: X-byte count */
#define USBIEPBBAX_4         0x23E1    /* Input Endpoint_4: X-buffer base addr. */
#define USBIEPCNF_4          0x23E0    /* Input Endpoint_4: Configuration */
#define USBIEPSIZXY_3        0x23DF    /* Input Endpoint_3: X/Y-buffer size */
#define USBIEPBCTY_3         0x23DE    /* Input Endpoint_3: Y-byte count */
#define USBIEPBBAY_3         0x23DD    /* Input Endpoint_3: Y-buffer base addr. */
//sfrb    Spare       (0x23DC)   /* Not used */
//sfrb    Spare       (0x23DB)   /* Not used */
#define USBIEPBCTX_3         0x23DA    /* Input Endpoint_3: X-byte count */
#define USBIEPBBAX_3         0x23D9    /* Input Endpoint_3: X-buffer base addr. */
#define USBIEPCNF_3          0x23D8    /* Input Endpoint_3: Configuration */
#define USBIEPSIZXY_2        0x23D7    /* Input Endpoint_2: X/Y-buffer size */
#define USBIEPBCTY_2         0x23D6    /* Input Endpoint_2: Y-byte count */
#define USBIEPBBAY_2         0x23D5    /* Input Endpoint_2: Y-buffer base addr. */
//sfrb    Spare       (0x23D4)   /* Not used */
//sfrb    Spare       (0x23D3)   /* Not used */
#define USBIEPBCTX_2         0x23D2    /* Input Endpoint_2: X-byte count */
#define USBIEPBBAX_2         0x23D1    /* Input Endpoint_2: X-buffer base addr. */
#define USBIEPCNF_2          0x23D0    /* Input Endpoint_2: Configuration */
#define USBIEPSIZXY_1        0x23CF    /* Input Endpoint_1: X/Y-buffer size */
#define USBIEPBCTY_1         0x23CE    /* Input Endpoint_1: Y-byte count */
#define USBIEPBBAY_1         0x23CD    /* Input Endpoint_1: Y-buffer base addr. */
//sfrb    Spare       (0x23CC)   /* Not used */
//sfrb    Spare       (0x23CB)   /* Not used */
#define USBIEPBCTX_1         0x23CA    /* Input Endpoint_1: X-byte count */
#define USBIEPBBAX_1         0x23C9    /* Input Endpoint_1: X-buffer base addr. */
#define USBIEPCNF_1          0x23C8    /* Input Endpoint_1: Configuration */
//sfrb       (0x23C7)   /* */
//sfrb     RESERVED         (0x1C00)    /* */
//sfrb       (0x23C0)   /* */
#define USBOEPSIZXY_7        0x23BF    /* Output Endpoint_7: X/Y-buffer size */
#define USBOEPBCTY_7         0x23BE    /* Output Endpoint_7: Y-byte count */
#define USBOEPBBAY_7         0x23BD    /* Output Endpoint_7: Y-buffer base addr. */
//sfrb    Spare       (0x23BC)   /* Not used */
//sfrb    Spare       (0x23BB)   /* Not used */
#define USBOEPBCTX_7         0x23BA    /* Output Endpoint_7: X-byte count */
#define USBOEPBBAX_7         0x23B9    /* Output Endpoint_7: X-buffer base addr. */
#define USBOEPCNF_7          0x23B8    /* Output Endpoint_7: Configuration */
#define USBOEPSIZXY_6        0x23B7    /* Output Endpoint_6: X/Y-buffer size */
#define USBOEPBCTY_6         0x23B6    /* Output Endpoint_6: Y-byte count */
#define USBOEPBBAY_6         0x23B5    /* Output Endpoint_6: Y-buffer base addr. */
//sfrb    Spare       (0x23B4)   /* Not used */
//sfrb    Spare       (0x23B3)   /* Not used */
#define USBOEPBCTX_6         0x23B2    /* Output Endpoint_6: X-byte count */
#define USBOEPBBAX_6         0x23B1    /* Output Endpoint_6: X-buffer base addr. */
#define USBOEPCNF_6          0x23B0    /* Output Endpoint_6: Configuration */
#define USBOEPSIZXY_5        0x23AF    /* Output Endpoint_5: X/Y-buffer size */
#define USBOEPBCTY_5         0x23AE    /* Output Endpoint_5: Y-byte count */
#define USBOEPBBAY_5         0x23AD    /* Output Endpoint_5: Y-buffer base addr. */
//sfrb    Spare       (0x23AC)   /* Not used */
//sfrb    Spare       (0x23AB)   /* Not used */
#define USBOEPBCTX_5         0x23AA    /* Output Endpoint_5: X-byte count */
#define USBOEPBBAX_5         0x23A9    /* Output Endpoint_5: X-buffer base addr. */
#define USBOEPCNF_5          0x23A8    /* Output Endpoint_5: Configuration */
#define USBOEPSIZXY_4        0x23A7    /* Output Endpoint_4: X/Y-buffer size */
#define USBOEPBCTY_4         0x23A6    /* Output Endpoint_4: Y-byte count */
#define USBOEPBBAY_4         0x23A5    /* Output Endpoint_4: Y-buffer base addr. */
//sfrb    Spare       (0x23A4)   /* Not used */
//sfrb    Spare       (0x23A3)   /* Not used */
#define USBOEPBCTX_4         0x23A2    /* Output Endpoint_4: X-byte count */
#define USBOEPBBAX_4         0x23A1    /* Output Endpoint_4: X-buffer base addr. */
#define USBOEPCNF_4          0x23A0    /* Output Endpoint_4: Configuration */
#define USBOEPSIZXY_3        0x239F    /* Output Endpoint_3: X/Y-buffer size */
#define USBOEPBCTY_3         0x239E    /* Output Endpoint_3: Y-byte count */
#define USBOEPBBAY_3         0x239D    /* Output Endpoint_3: Y-buffer base addr. */
//sfrb    Spare       (0x239C)   /* Not used */
//sfrb    Spare       (0x239B)   /* Not used */
#define USBOEPBCTX_3         0x239A    /* Output Endpoint_3: X-byte count */
#define USBOEPBBAX_3         0x2399    /* Output Endpoint_3: X-buffer base addr. */
#define USBOEPCNF_3          0x2398    /* Output Endpoint_3: Configuration */
#define USBOEPSIZXY_2        0x2397    /* Output Endpoint_2: X/Y-buffer size */
#define USBOEPBCTY_2         0x2396    /* Output Endpoint_2: Y-byte count */
#define USBOEPBBAY_2         0x2395    /* Output Endpoint_2: Y-buffer base addr. */
//sfrb    Spare       (0x2394)   /* Not used */
//sfrb    Spare       (0x2393)   /* Not used */
#define USBOEPBCTX_2         0x2392    /* Output Endpoint_2: X-byte count */
#define USBOEPBBAX_2         0x2391    /* Output Endpoint_2: X-buffer base addr. */
#define USBOEPCNF_2          0x2390    /* Output Endpoint_2: Configuration */
#define USBOEPSIZXY_1        0x238F    /* Output Endpoint_1: X/Y-buffer size */
#define USBOEPBCTY_1         0x238E    /* Output Endpoint_1: Y-byte count */
#define USBOEPBBAY_1         0x238D    /* Output Endpoint_1: Y-buffer base addr. */
//sfrb    Spare       (0x238C)   /* Not used */
//sfrb    Spare       (0x238B)   /* Not used */
#define USBOEPBCTX_1         0x238A    /* Output Endpoint_1: X-byte count */
#define USBOEPBBAX_1         0x2389    /* Output Endpoint_1: X-buffer base addr. */
#define USBOEPCNF_1          0x2388    /* Output Endpoint_1: Configuration */
#define USBSUBLK             0x2380    /* Setup Packet Block */
#define USBIEP0BUF           0x2378    /* Input endpoint_0 buffer */
#define USBOEP0BUF           0x2370    /* Output endpoint_0 buffer */
#define USBTOPBUFF           0x236F    /* Top of buffer space */
//         (1904 Bytes)               /* Buffer space */
#define USBSTABUFF           0x1C00    /* Start of buffer space */

/* USBIEPCNF_n Control Bits */
/* USBOEPCNF_n Control Bits */
//#define RESERVED       (0x0001)  /* USB -  */
//#define RESERVED       (0x0001)  /* USB -  */
#define DBUF           (0x0010)  /* USB - Double Buffer Enable */
//#define RESERVED       (0x0040)  /* USB -  */

/* USBIEPBCNT_n Control Bits */
/* USBOEPBCNT_n Control Bits */
#define CNT4           (0x0010)  /* USB - Byte Count Bit 3 */
#define CNT5           (0x0020)  /* USB - Byte Count Bit 3 */
#define CNT6           (0x0040)  /* USB - Byte Count Bit 3 */
/************************************************************
* UNIFIED CLOCK SYSTEM
************************************************************/

